libretiny-eu/libretiny/boards/cb2l/variant.h
/* This file was auto-generated from cb2l.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         9
#define NUM_DIGITAL_PINS   9
#define NUM_ANALOG_OUTPUTS 0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 0

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 1
#define PIN_SERIAL1_RX          5u // GPIO10
#define PIN_SERIAL1_TX          7u // GPIO11
